/*
 * @Author: Hailen
 * @Date: 2023-07-05 10:34:19
 * @Last Modified by: Hailen
 * @Last Modified time: 2024-08-08 18:40:48
 */

/**
 * 全局正则表达式
 */
export default {
  /** 金额(保留2位数) */
  price: /^(([1-9]{1}\d*)|([0]{1}))(\.(\d){1,2})?$/,
  /** 金额2(保留2位数) */
  money: /^(0|[1-9]\d*)(\.\d{1,2})?$/,
  /** 大于0的订单数量 */
  quantity: /^(0|[1-9]\d*)$/,
  /** 大于0的数字 */
  number: /^[1-9][0-9]*$/,
  /** 判断是数字 */
  number2: /^[+-]?\d*(\.\d*)?(e[+-]?\d+)?$/,
  /** 大于等于0的数字 */
  number3: /^(0|[1-9]\d*)$/,
  /** 端口 2位数以上 */
  port: /^[0-9]{0,5}$/,
  /** 匹配1-65535端口号 */
  port2: /^(6553[0-5]|655[0-2]\d|65[0-4]\d{2}|6[0-4]\d{3}|[1-5]?\d{1,4})$/,
  /** 英文加数字 3位数以上 */
  password: /^[a-zA-Z0-9]{3,12}$/,
  /** 动态表格配置字段 */
  dbField: /^[a-zA-Z0-9_.]*$/,
  /** 大于0的数字 */
  code: /^\d{6}$/,
  /** 匹配手机号码 */
  phone: /^[1][3,4,5,6,7,8,9][0-9]{9}$/i,
  /** 匹配手机号码 */
  tel: /^(0|86|17951)?(13[0-9]|14[0-9]|15[0-9]|16[0-9]|17[0-9]|18[0-9])[0-9]{8}$/i,
  /** 匹配网址 */
  address:
    /^(https?|ftp):\/\/([a-zA-Z0-9.-]+(:[a-zA-Z0-9.&%$-]+)*@)*((25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9][0-9]?)(\.(25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9]?[0-9])){3}|([a-zA-Z0-9-]+\.)*[a-zA-Z0-9-]+\.(com|edu|gov|int|mil|net|org|biz|arpa|info|name|pro|aero|coop|museum|[a-zA-Z]{2}))(:[0-9]+)*(\/($|[a-zA-Z0-9.,?'\\+&%$#=~_-]+))*$/,
  /** 匹配身份证号码 */
  idCard: /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$|^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X)$/,
  /** 密码正则（密码格式应为8-18位数字、字母、符号的任意两种组合） */
  REGEXP_PWD: /^(?![0-9]+$)(?![a-z]+$)(?![A-Z]+$)(?!([^(0-9a-zA-Z)]|[()])+$)(?!^.*[\u4E00-\u9FA5].*$)([^(0-9a-zA-Z)]|[()]|[a-z]|[A-Z]|[0-9]){8,18}$/,
  /** 以字母、数字和下划线组合, 用逗号隔开 */
  dbCommaSplit: /^[a-zA-Z0-9_]+(?:,[a-zA-Z0-9_]+)*$/,
  /** 表名.字段组合,多行使用换行符 */
  tableMap: /^[a-zA-Z0-9_.]+(?:\n[a-zA-Z0-9_.]+)*$/,
  /** 名称.字段组合,多行使用换行符 */
  nameMap: /^([a-zA-Z0-9_.]|(.+\.))+(?:\n([a-zA-Z0-9_.]|(.+\.))+)*$/,
  /** 名称#字段组合,多行使用换行符 */
  nameMap2: /^([a-zA-Z0-9_.]|(.+#))+(?:\n([a-zA-Z0-9_.]|(.+#))+)*$/,
  /** 匹配邮箱 */
  email: /^([a-zA-Z0-9_-])+@([a-zA-Z0-9_-])+(.[a-zA-Z0-9_-])+/,
  /** 匹配值M1-M12的任意一个 */
  mMonth: /M(?:[1-9]|1[0-2])/g
};
